<?php
/**
 * Created by PhpStorm.
 * User: zhaojipeng
 * Date: 17/8/19
 * Time: 16:06
 */


return [

    'type' => [
        1 => '上班族',
        2 => '企业主',
        3 => '无固定职业',
        4 => '电商主',
        5 => '个体户'
    ],

    //房产相关
    'house_type' => [
        1 => '无房产',
        2 => '有房产，未抵押',
        3 => '有房产，已抵押',
    ],

    'house_pledge' => [
        1 => '否，不接受抵押',
        2 => '是，接受抵押',
    ],

    'house_leixing' => [
        1 => '商品住宅',
        2 => '商铺',
        3 => '办公楼',
        4 => '厂房',
        5 => '经适/限价房',
        6 => '房改/危改房',
        7 => '其他',

    ],

    //车产相关
    'car_type' => [
        1 => '无车产',
        2 => '有车，未抵押',
        3 => '有车，已抵押',
        4 => '无车，准备购买'
    ],

    'car_pledge' => [
        1 => '否，不接受抵押',
        2 => '是，接受抵押',
    ],

    //贷款用途
    'use' => [
        1 => '新车购车贷款',
        2 => '二手车购车贷款',
        3 => '新房首付贷款',
        4 => '新房购房贷款',
        5 => '二手房购房贷款',
        6 => '过桥短期贷款',
        7 => '装修贷款',
        8 => '教育培训贷款',
        9 => '旅游贷款',
        10 => '股票配资贷款',
        11 => '三农贷款',
        12 => '其他'
    ],

    //职业身份
    'profession' => [
        1 => '私营企业员工',
        2 => '国企单位员工',
        3 => '事业单位员工',
        4 => '公务员',
        5 => '自由职业者',
        6 => '其他',
    ],

    //工资形式
    'salary_type' => [
        1 => '银行代发',
        2 => '转账工资',
        3 => '现金发放',
        4 => '自由职业收入'
    ],

    //公积金
    'is_fund' => [
        1 => '是,有本地公积金',
        2 => '否,无本地公积金',
    ],

    //社保
    'is_security' => [
        1 => '是,有本地社保',
        2 => '否,无本地社保',
    ],

    //企业类型
    'company' => [
        1 => '政府',
        2 => '事业单位',
        3 => '国有企业',
        4 => '上市公司',
        5 => '外资企业',
        6 => '大型企业（年收入5亿以上）',
        7 => '中小型企业（年收入5000万-5亿）',
        8 => '小微型企业（年收入5000万以下）',
        9 => '个体户',
    ],

    //公司行业
    'industry' => [
        1 => '批发/零售',
        2 => '制造业',
        3 => '金融/保险/证券',
        4 => '住宿/餐饮/旅游',
        5 => '商业服务/娱乐/艺术/体育',
        6 => '计算机/互联网',
        7 => '通信电子',
        8 => '建筑/房地产',
        9 => '法律/咨询',
        10 => '卫生/教育/社会服务',
        11 => '公共事业/社会团体',
        12 => '生物/制药',
        13 => '广告/媒体',
        14 => '能源',
        15 => '贸易',
        16 => '交通运输/仓储/物流',
        17 => '农林/牧/渔',
        18 => '其他',
    ],

    //经营年限
    'manage_year' => [
        1=>'不足3个月',
        2=>'3个月',
        3=>'半年',
        4=>'1年',
        5=>'2年',
        6=>'3年',
        7=>'5年及以上',
    ],

    //经营注册地
    'manage_address'=>[
        1=>'本地',
        2=>'外地',
        3=>'未注册经营执照',
    ],

    //有无贷款成功记录
    'has_loan' => [
        1 => '有',
        2 => '无',
    ],

    //负债情况
    'has_debt' => [
        1 => '无',
        2 => '有',
    ],
    //信用状况
    'credit_card'=> [
        1 => '有信用卡或贷款，无逾期',
        2 => '无信用卡或贷款',
        3 => '1年内逾期少于3次且少于90天',
        4 => '1年内逾期超过3次或超过90天',
    ],

    'is_buy_insurance' => [1=>'否',2=>'是'],

    'insurance_company' => [
        1 => '安邦保险',
        2 => '中国平安',
        3 => '前海人寿',
        4 => '中国人寿',
        5 => '太平洋保险',
        6 => '泰康人寿',
        7 => '新华保险',
        8 => '阳光保险',
        9 => '招商信诺',
        10 => '中国太平',
        11 => '其他',
    ],

    'insurance_value' => [
        1 => '',
    ],

    'insurance_time' => [
        1 => '不足3个月',
        2 => '3~5个月',
        3 => '6~11个月',
        4 => '1~3年',
        5 => '4~7年',
        6 => '7年以上',
    ],

    'is_have_shop' => [1=>'否',2=>'是'],

    'shop_platform' => [
        1 => '京东',
        2 => '淘宝',
        3 => '天猫',
        4 => 'ebay',
        5 => 'amazon',
        6 => '其他',
    ],

    'shop_time' => [
        1 => '不足3个月',
        2 => '3~5个月',
        3 => '6~11个月',
        4 => '1~3年',
        5 => '4~7年',
        6 => '7年以上',
    ],

    'shop_num' => [
        1 => '',
    ],

    //pos
    'is_have_pos' => [1=>'否',2=>'是'],

    'pos_time' => [
        1 => '不足3个月',
        2 => '3~5个月',
        3 => '6~11个月',
        4 => '1~3年',
        5 => '4~7年',
        6 => '7年以上',
    ],
    //积分操作类型
    'change_type' => [
        1 => '收入',
        2 => '支出',
    ],

    //积分变更操作
    'account_type' => [
        //1 => '推单扣积分'  //在后台积分操作中不显示
        2 => '充值',
        3 => '业务分成扣费',
        4 => '余额提现扣费',
    ],
    'account_change_type' => [
        2 => 1,
        3 => 2,
        4 => 2,
    ],

    'audit_status' => [
        1 => '待审核',
        2 => '条件不符',
        3 => '电话未接通',
        4 => '用户考虑中',
        5 => '用户放弃',
        6 => '邀约到店中',
        7 => '提交资料',
        8 => '提交审批中',
        9 => '审批通过',
        10 => '审批未通过',
        11 => '完成放款',
    ],

    'settlement' => [
        1 => '按放款金额结算',
        2 => '按服务费结算',
        3 => '按放款金额+服务费结算'
    ],

    'settlement_show' => [
        1 => '放款金额',
        2 => '服务费'
    ],

    'push_type' => [
        1 => '人工审核订单',
        2 => '推B端前订单'
    ],

    'push_status' => [
        1 => '开启',
        0 => '关闭'
    ]
];